package personalpractice;

public class B05 {

	public static void main(String[] args) {
	
		
		Q.02 여러분들의 명단을 배열로 입력받아 같은 성을 가진 사람이 몇 ,
		명인지 출력하는 메소드를 만들어주세요.
	
String[] nameLiStrings = {
	"강성준","권보성",
	"권유빈",
	"김기찬",
	"김대영",
	"김동우",
	"김동현",
	"김명기",
	"김영주",
	"김유정",
	"김은혜",
	"김휘건",
	"나항진",
	"문성민",
	"박진기",
	"백현진",
	"오정연",
	"유하영",
	"이예진",
	"이용빈",
	"정유진"};
SearchName("김", nameList);

실행 결과
=========================
김씨 성을 가진 동기분이 총 9명 있습니다.
김기찬씨 김대영씨 김동우씨 김동현씨 김명기씨 김영주씨 김유정씨 김은혜씨 김휘건씨
=========================
}